{"keras_version": "2.0.8", "backend": "tensorflow", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"name": "lambda_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "output_shape": null, "arguments": {}, "function_type": "lambda"}, "class_name": "Lambda"}, {"name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "filters": 24, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "elu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"name": "dropout_1", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "trainable": true, "kernel_constraint": null, "filters": 36, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "elu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"name": "dropout_2", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"name": "conv2d_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [2, 2], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_3", "trainable": true, "kernel_constraint": null, "filters": 48, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "elu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"name": "dropout_3", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_4", "trainable": true, "kernel_constraint": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "elu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"name": "dropout_4", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"name": "conv2d_5", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_5", "trainable": true, "kernel_constraint": null, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "elu_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"name": "dropout_5", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}, "class_name": "Dropout"}, {"name": "flatten_1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 100, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "elu_6", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"name": "dropout_6", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_6"}, "class_name": "Dropout"}, {"name": "dense_2", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 50, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "elu_7", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"name": "dropout_7", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_7"}, "class_name": "Dropout"}, {"name": "dense_3", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 10, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "elu_8", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"name": "dense_4", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_4", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 1, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}