{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 66, 200, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Lambda", "name": "lambda_1", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "filters": 24, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "filters": 36, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "filters": 48, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "use_bias": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "use_bias": true}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.2}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 100, "name": "dense_1", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 50, "name": "dense_2", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"units": 10, "name": "dense_3", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"units": 1, "name": "dense_4", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}}
